Revit 2024 API
IntersectionResultArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual IntersectionResultArrayIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As IntersectionResultArrayIterator
Visual C++
public:
virtual IntersectionResultArrayIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the array.
See Also
IntersectionResultArray Class
Autodesk.Revit.DB Namespace